const {Markup} = require('telegraf');
//----global-buttons------------
module.exports =  function getMainMenu() {
    return Markup.keyboard([
        ['📞 Номер телефона', '💰Номер кошелька'],
        ['🚗 Авто','👨 ФИО','Ник'],
        ['🏡 Адрес','Облоко','Документ📄'],
        ['🔍Поисковики','👱 Биометрия', 'Аккаунт'],
        ['Базы 🗄','E-mail📧','Пароль 🔥'],
        ['Текст ​�','Трекер💻','Домен🗺'],
        ['Чеки 💶','🛠 Инструменты','Файл⌨️'],
        ['Симки','Сайт','🔙 Назад'],
        ['😎Контакты']
    ]).resize()
}